docs/git-taster.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 22:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Version control with Git: a taster</title>
<meta name="author" content="Thibault Lestang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="rethink_inline.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Version control with Git: a taster</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgff4e57b">1. Setup</a></li>
<li><a href="#org2627260">2. Telling Git who you are</a></li>
<li><a href="#org95a7267">3. You first commit!</a></li>
<li><a href="#org1ecc1d3">4. Change, commit, repeat.</a></li>
<li><a href="#orgfd672d1">5. Showing versions and the history</a></li>
<li><a href="#orgd22308f">6. Time travel!</a></li>
<li><a href="#orge201507">7. Let's branch out</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgff4e57b" class="outline-2">
<h2 id="orgff4e57b"><span class="section-number-2">1.</span> Setup</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-shell">git clone git@github.com:tlestang/git-intro.git
<span style="color: #483d8b;">cd</span> git-intro/taster
</pre>
</div>
</div>
</div>

<div id="outline-container-org2627260" class="outline-2">
<h2 id="org2627260"><span class="section-number-2">2.</span> Telling Git who you are</h2>
<div class="outline-text-2" id="text-2">
<p>
Git tracks changes in your projects by recording what was changed,
when, and by whom. Therefore, before you can use it, you need to tell
git who you are.
</p>

<div class="org-src-container">
<pre class="src src-shell">git config --global user.name &lt;username&gt;
git config --global user.email &lt;email&gt;
</pre>
</div>

<p>
Note that "who you are" is completely up to you. You can choose to use
your name, or a pseudonym. This information is required by Git only to
attach this metada to different versions of your code, and this
metadata is only located within your computer. It will however be made
public on the internet when you publish these versions.
</p>

<p>
In my case, this would look like
</p>

<div class="org-src-container">
<pre class="src src-shell">git config --global user.name <span style="color: #8b2252;">"Thibault Lestang"</span>
git config --global user.email t.lestang@imperial.ac.uk
</pre>
</div>
</div>
</div>

<div id="outline-container-org95a7267" class="outline-2">
<h2 id="org95a7267"><span class="section-number-2">3.</span> You first commit!</h2>
<div class="outline-text-2" id="text-3">
<p>
We start with a small Python script that reads some example data from
disk:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> numpy <span style="color: #a020f0;">as</span> np

<span style="color: #a0522d;">filename</span> = <span style="color: #8b2252;">"example_data.csv"</span>
<span style="color: #a0522d;">data</span> = np.loadtxt(filename, delimiter=<span style="color: #8b2252;">","</span>)
</pre>
</div>

<ol class="org-ol">
<li><p>
Let's add a couple of lines to plot the data
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> matplotlib.pyplot <span style="color: #a020f0;">as</span> plt
plt.plot(data[:, 0], data[:, 1], <span style="color: #8b2252;">"ro"</span>)
</pre>
</div></li>
<li><p>
Check the status of your project
</p>
<div class="org-src-container">
<pre class="src src-shell">git status
</pre>
</div></li>
<li><p>
Record a new version (or <i>revision</i>, or <i>commit</i>) including your
changes:
</p>
<div class="org-src-container">
<pre class="src src-shell">git commit -am <span style="color: #8b2252;">"Plot input data"</span>
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org1ecc1d3" class="outline-2">
<h2 id="org1ecc1d3"><span class="section-number-2">4.</span> Change, commit, repeat.</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><p>
Now, let's fit our data using a second order polynomial
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">model</span>(x, p1, p2):
    <span style="color: #a020f0;">return</span> p1 * np.cos(p2 * x) + p2 * np.sin(p1 * x)

<span style="color: #a020f0;">from</span> scipy.optimize <span style="color: #a020f0;">import</span> curve_fit
<span style="color: #a0522d;">popt</span>, <span style="color: #a0522d;">pcov</span> = curve_fit(model, data[:, 0], data[:, 1], p0=(1, 0.2))
<span style="color: #483d8b;">print</span>(f<span style="color: #8b2252;">"The parameters are p1 = </span>{popt[0]}<span style="color: #8b2252;"> and p2 = </span>{popt[1]}<span style="color: #8b2252;">"</span>)
</pre>
</div></li>

<li><p>
Record a new snapshot with <code>git commit</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell">git commit -am <span style="color: #8b2252;">"Fit data with second order polynomial"</span>
</pre>
</div></li>

<li><p>
use <code>git diff</code> to ask Git to show the difference between the
current state of your project and the last recorded snapshot.
</p>

<div class="org-src-container">
<pre class="src src-shell">git diff
</pre>
</div></li>

<li><p>
Let's change out mind: modify the call to <code>plt.plot</code> to display the
data points as stars instead of circles:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #0000ff;">plt.plot</span>(data[:, 0], data[:, 1], <span style="color: #8b2252;">"r*"</span>)
</pre>
</div></li>
<li><p>
Record a new snapshot with <code>git commit</code>
</p>

<div class="org-src-container">
<pre class="src src-shell">git commit -am <span style="color: #8b2252;">"Plot data with stars instead of circles"</span>
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orgfd672d1" class="outline-2">
<h2 id="orgfd672d1"><span class="section-number-2">5.</span> Showing versions and the history</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><p>
Use <code>git show</code> to ask Git to display the changes introduced by the
last recorded snapshot
</p>

<div class="org-src-container">
<pre class="src src-shell">git show HEAD
</pre>
</div></li>

<li><p>
Or the one before that
</p>
<div class="org-src-container">
<pre class="src src-shell">git show HEAD~1
</pre>
</div></li>

<li><p>
Display to history of all recorded versions using <code>git log</code>
</p>
<div class="org-src-container">
<pre class="src src-shell">git log
</pre>
</div></li>

<li>By default, <code>git diff</code> displays the changes between the current
state of the project and the last recorded snapshot. But given two
commit version identifiers (<code>git diff id1 id2</code>), Git displays the
difference between the two versions. Version identifiers are
displayed by <code>git log</code> as 40-digit long hexadecimal numbers. Use
<code>git diff</code> to display the difference(s) between two versions.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd22308f" class="outline-2">
<h2 id="orgd22308f"><span class="section-number-2">6.</span> Time travel!</h2>
<div class="outline-text-2" id="text-6">
<p>
Git is more more than a fancy logging system.
</p>

<ol class="org-ol">
<li><p>
Use <code>git checkout</code> to restore you the state of the project exactly
as it was after you logged your second version. You'll need to look
up the identifier for the second revision using <code>git log</code>, then
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">For example - your identifier number will be different</span>
git checkout a20dd4239b418e83bd1ba3928ed75f98d6621fc5
</pre>
</div></li>

<li><p>
Look around, then travel back to present times
</p>

<div class="org-src-container">
<pre class="src src-shell">git checkout main
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orge201507" class="outline-2">
<h2 id="orge201507"><span class="section-number-2">7.</span> Let's branch out</h2>
<div class="outline-text-2" id="text-7">
<p>
Git is very popular for its branching model that allows to work on
parallel lines of developement. See for yourself:
</p>

<ol class="org-ol">
<li><p>
Let's visit the first version you recorded today. Use <code>git log</code> to
find its identifier to use with <code>git checkout</code>, or
</p>
<div class="org-src-container">
<pre class="src src-shell">git checkout HEAD~2 <span style="color: #b22222;"># </span><span style="color: #b22222;">Back 2 verions before the top one</span>
</pre>
</div></li>

<li><p>
Start a new branch called <code>docs</code> from this version
</p>
<div class="org-src-container">
<pre class="src src-shell">git switch -c docs
</pre>
</div></li>

<li><p>
Add a "documentation string" at the top of the script <code>fit_noisy_data.py</code>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8b2252;">"""</span>
<span style="color: #8b2252;">This is a example python script that plots some data</span>
<span style="color: #8b2252;">"""</span>
<span style="color: #a020f0;">import</span> numpy <span style="color: #a020f0;">as</span> np

<span style="color: #a0522d;">filename</span> = <span style="color: #8b2252;">"example_data.csv"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">...</span>
</pre>
</div></li>

<li><p>
Record a new version with the new docstring
</p>
<div class="org-src-container">
<pre class="src src-shell">git commit -am <span style="color: #8b2252;">"Add a docstring"</span>
</pre>
</div></li>

<li><p>
Visualise the history with
</p>
<div class="org-src-container">
<pre class="src src-shell">git log --graph --all
</pre>
</div></li>

<li><p>
Let's merge our branch <code>docs</code> into the main trunk (branch called
<code>main</code>). First, get back to the <code>main</code> trunk:
</p>
<div class="org-src-container">
<pre class="src src-shell">git checkout main
</pre>
</div></li>

<li><p>
Finally, merge the <code>docs</code> branch into the main trunk:
</p>
<div class="org-src-container">
<pre class="src src-shell">git merge docs
</pre>
</div></li>

<li><p>
Visualise the merged history with
</p>
<div class="org-src-container">
<pre class="src src-shell">git log --graph --all
</pre>
</div>

<p>
You can also try to add the <code>--oneline</code> option to <code>git log</code>.
</p></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Thibault Lestang</p>
<p class="date">Created: 2022-12-01 Thu 22:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
